<template>
  <main
    class="container max-w-5xl px-4 xl:px-[103px] mx-auto gap-x-6 h-full pt-10 pb-4 flex flex-col"
  >
    <div
      class="px-4 py-6 bg-white rounded-3xl min-h-[75vh] mb-28 md:py-20 md:px-20 md:min-h-0 md:mb-0"
    >
      <img src="/data-ai-logo.png" class="mx-auto w-60" />
      <img
        :src="profileState.pictureUrl"
        class="mx-auto mt-4 mb-4 w-24 rounded-full"
      />
      <div class="mt-4">
        <h1 class="text-xl font-bold">
          🚨 สัญญาณเตือนภัย! เตรียมพร้อมสำหรับภารกิจ 🚨
        </h1>
        <br />
        สวัสดีเหล่า นักสำรวจผู้กล้าหาญ {{ profileState.displayName }}<br />
        &nbsp;&nbsp;&nbsp;&nbsp;คุณได้รับเลือกให้เข้าร่วมทีมพิเศษเพื่อปฏิบัติภารกิจที่ยิ่งใหญ่ที่สุดในประวัติศาสตร์
        <br class="hidden lg:block" />
        การสำรวจดาวเคราะห์ Data ที่ไร้แผนที่และไม่เคยมีใครย่างกรายไปถึง
        <br />
        <br />
        ก่อนที่เราจะก้าวออกจากยาน เพื่อเผชิญหน้ากับดินแดนที่ไม่รู้จัก
        เราจำเป็นต้องรู้ว่าในสถานการณ์คับขัน คุณมี พลังพิเศษ หรือ บทบาทหลัก
        อะไรที่จะช่วยให้ทีมอยู่รอดและพิชิตภารกิจนี้ได้
        <br />
        <br />
        <h2 class="font-bold text-center">
          มาค้นหาบทบาทที่แท้จริงของคุณในทีมสำรวจกันเถอะ!
        </h2>

        อ่านแต่ละสถานการณ์เลือกคำตอบที่ตรงกับ ความเป็นตัวคุณมากที่สุด<br
          class="hidden lg:block"
        />
        คำตอบของคุณจะบ่งบอกถึง บทบาท และ พลังพิเศษที่ซ่อนอยู่ในตัวคุณ ✨
        <div
          class="flex flex-col gap-2 justify-center items-center mt-10 text-center"
        >
          <img src="/supporter.png" class="w-48" />
        </div>
      </div>
    </div>
  </main>
</template>

<script setup lang="ts">
defineProps({
  profileState: {
    type: Object,
    required: true,
  },
});
</script>
